app/controllers/posts_controller.rb

  def create #form submits to create
    @post = Post.new
    @post.title = params[:title]
    @post.description = params[:description]
    @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rails Introduction Quiz"], ["description", "asdfasdf"], ["created_at", "2015-12-31 19:45:03.614973"], ["updated_at", "2015-12-31 19:45:03.614973"]]

  def edit #render a form to edit a resource
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]

  def update #user submits the form to
    @post = Post.find(params[:id])
    @post.title = params[:post][:title]
    @post.description = params[:post][:description]
    @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2018-09-25 20:43:51.445495"], ["id", 1]]